Repository: NERC-CEH/lerc-wales-app
Catalog: src/common/translations/interface/*.po
Languages: cy

source: Please press the plus <2></2> button in the home page. This will bring you to the taxa search page. After selecting the species, open the record (either by opening it directly from the taxa search page using the edit button <5></5> beside the species name or through the home-list page) and fill in the details of the sighting, like location, date, number seen etc.
cy: Pwyswch y botwm plws <2></2> ar yr hafan. Bydd yn mynd â chi i'r dudalen chwilio tacsa. Ar ôl dewis y rhywogaeth, agorwch y cofnod (naill ai drwy ei agor yn uniongyrchol o'r dudalen chwilio tacsa gan ddefnyddio'r botwm golygu <5></5> wrth ymyl enw'r rhywogaeth neu drwy dudalen rhestr yr hafan) a llenwi'r manylion am yr hyn a welwyd, fel lleoliad, dyddiad, nifer a welwyd ac ati.

source: Type in a species name - English or scientific name, or a genus or family etc.
cy: Teipiwch enw rhywogaeth - Saesneg neu enw gwyddonol, neu genws neu deulu ac ati.

source: To find a species from its scientific name you can use shortcuts, e.g. to find <i>Bellis perrenis</i> (Daisy) you can type:
cy: I ddod o hyd i rywogaeth oddi wrth ei henw gwyddonol gallwch ddefnyddio llwybrau byr, e.e. i ddod o hyd i <i>Bellis perrenis</i> (Llygad y dydd) gallwch deipio:

source: Once you have added the name, you can add a photo and the app will suggest an identification based on the photo.
cy: Unwaith y byddwch wedi ychwanegu'r enw, gallwch ychwanegu ffotograff a bydd yr ap yn awgrymu enw yn seiliedig ar y ffotograff.

source: All your saved records will be shown on the home page. By default a record is in <i>draft</i> mode until it is set for upload. While it is in <i>draft</i> mode the application will not synchronise your record with the database.
cy: Bydd eich holl gofnodion sydd wedi'u cadw yn cael eu dangos ar yr hafan. Yn ddiofyn, mae cofnod yn y modd <i>draft</i> nes iddo gael ei osod i'w uwchlwytho. Tra mae yn y modd <i>draft</i> ni fydd y rhaglen yn cysoni eich cofnod â'r gronfa ddata.

source: To set it for upload, open the record and press the Upload button in the header. The application will try to submit your record once there is a good network connection. If the record has reached the database, it will be moved to the Uploaded list in the Home page (see Uploaded tab).
cy: I'w osod i'w uwchlwytho, agorwch y cofnod a gwasgwch y botwm Uwchlwytho yn y pennyn. Bydd y cais yn ceisio cyflwyno'ch cofnod unwaith y bydd cysylltiad rhwydwaith da. Os yw'r cofnod wedi cyrraedd y gronfa ddata, bydd yn cael ei symud i'r rhestr Wedi'i Uwchlwytho yn yr Hafan (edrychwch ar y tab Wedi'i Uwchlwytho).

source: Once it has successfully reached the database the record becomes unavailable for new edits. To further edit it please use the <1>iRecord Website</1>.
cy: Unwaith y bydd wedi cyrraedd y gronfa ddata yn llwyddiannus ni fydd y cofnod ar gael ar gyfer ei olygu o'r newydd. I'w olygu ymhellach defnyddiwch <1>Wefan iRecord</1>.

source: <0>Note:</0> you have to be signed in to your iRecord account and have a network connection, for the records to be automatically synchronised in the background.
cy: <0>Sylwer:</0> rhaid i chi fod wedi mewngofnodi i'ch cyfrif iRecord a bod â chysylltiad rhwydwaith er mwyn i'r cofnodion gael eu cysoni'n awtomatig yn y cefndir.

source: To delete a record, swipe it left in the Home page and click the delete <1></1> button.
cy: I ddileu cofnod, sweipiwch ef i'r chwith yn yr Hafan a chliciwch ar y botwm dileu <1></1>.

source: You can also remove all the locally saved records that have been successfully synchronised with the database. This will leave the records in the database untouched. To do that go to settings page <1></1> and click <4>Remove Uploaded Surveys</4> <6></6> button.
cy: Gallwch hefyd gael gwared ar yr holl gofnodion sydd wedi'u cadw'n lleol sydd wedi'u cysoni'n llwyddiannus â'r gronfa ddata. Bydd hyn yn gadael y cofnodion yn y gronfa ddata heb eu cyffwrdd. I wneud hynny ewch i'r dudalen gosodiadau <1></1> a chlicio ar y botwm <4>Dileu Arolygon Wedi'u Huwchlwytho</4> <6></6>.

source: To lock an attribute swipe the menu attribute item to the left and click on the lock <2></2> button. This will change the symbol to locked <5></5> both on the button and next to the attribute.
cy: I gloi nodwedd, sweipiwch eitem nodwedd y ddewislen i'r chwith a chliciwch ar y botwm <2></2> cloi. Bydd hyn yn newid y symbol i gloi <5></5> ar y botwm a nesaf at y nodwedd.

source: <0>Note:</0> For a GPS-sourced location, only the location name can be locked, not the GPS value. As you move about, the GPS value will change. This will allow recording of different GPS values within an named area while keeping the location name the same. You can lock a location if it is selected using a map or entered manually.
cy: <0>Sylwer:</0> Ar gyfer lleoliad o ffynhonnell GPS, dim ond enw’r lleoliad y mae posib ei gloi, nid y gwerth GPS. Wrth i chi symud o gwmpas, bydd y gwerth GPS yn newid. Bydd hyn yn galluogi cofnodi gwahanol werthoedd GPS mewn ardal benodol ond cadw enw’r lleoliad yr un fath. Gallwch gloi lleoliad os caiff ei ddewis gan ddefnyddio map neu ei roi i mewn gyda llaw.

source: To login, open the main menu page <2></2>, click Login <5></5> or Register <8></8> buttons and follow the instructions.
cy: I fewngofnodi, agorwch dudalen y brif ddewislen <2></2>, cliciwch ar y botymau Mewngofnodi <5></5> neu Gofrestru <8></8> a dilynwch y cyfarwyddiadau.

source: To logout, visit the main menu page <2></2> and click the logout <4></4> button
cy: I allgofnodi, ewch i dudalen y brif ddewislen <2></2> a chliciwch ar y botwm <4></4> allgofnodi

source: <0>Note:</0> after registering a new account you must verify your email address by clicking on a verification link sent to your email.
cy: <0>Sylwer:</0> ar ôl cofrestru cyfrif newydd rhaid i chi wirio eich cyfeiriad e-bost drwy glicio ar ddolen ddilysu a anfonwyd i'ch e-bost.

source: Verification of your records
cy: Dilysu eich cofnodion.

source: When you add a record to the app and then upload it to iRecord, it may be checked by one of the expert verifiers who volunteer on behalf of the national or local wildlife recording schemes. If that happens you will see notifications in the app to tell you that the record has been accepted or not.
cy: Pan fyddwch chi'n ychwanegu cofnod at yr ap ac yna'n ei uwchlwytho i iRecord, efallai y bydd yn cael ei wirio gan un o'r dilyswyr arbenigol sy'n gwirfoddoli ar ran y cynlluniau cofnodi bywyd gwyllt cenedlaethol neu leol. Os bydd hynny'n digwydd fe welwch hysbysiadau yn yr ap i ddweud wrthych fod y cofnod wedi'i dderbyn ai peidio.

source: Some verifiers may have added additional comments or queries to your records, and at the moment these are not available within the app, so you may wish to log on to the iRecord website and view your records and notifications there.
cy: Efallai bod rhai dilyswyr wedi ychwanegu sylwadau neu ymholiadau ychwanegol at eich cofnodion, ac ar hyn o bryd nid yw’r rhain ar gael o fewn yr ap, felly efallai y byddwch eisiau mewngofnodi i wefan iRecord a gweld y cofnodion a'r hysbysiadau yno.

source: If you do not wish to see the notifications in the app you can tick the box for “Do not show again”, but if you do this the notifications will become unavailable unless you reset the app settings or reinstall the app.
cy: Os nad ydych chi eisiau gweld yr hysbysiadau yn yr ap gallwch dicio'r bocs ar gyfer “Peidiwch â dangos eto”, ond os gwnewch hyn ni fydd yr hysbysiadau ar gael oni bai eich bod yn ailosod gosodiadau'r ap neu'n ailosod yr ap.

source: For more information about the record checking process see <2>Verification: what, who and why</2> on the iRecord website.
cy: I gael rhagor o wybodaeth am y broses gwirio cofnodion edrychwch ar <2>Gwirio: beth, pwy a pham</2> ar wefan iRecord.

source: To send records to a specific activity you can select it in the Activities <1></1> page.
cy: I anfon cofnodion i weithgaredd penodol gallwch ei ddewis yn y dudalen <1></1> Gweithgareddau.

source: <0>Note:</0> only the activities that allow this mobile app records and only the ones that you have joined on the iRecord website will be available to select.
cy: <0>Sylwer:</0> dim ond y gweithgareddau sy'n caniatáu i'r ap symudol hwn gofnodi a dim ond y rhai rydych chi wedi ymuno â nhw ar wefan iRecord fydd ar gael i'w dewis.

source: You can manage your saved locations both on any record's location page and from the settings <2></2> page
cy: Gallwch reoli eich lleoliadau sydd wedi'u cadw ar dudalen lleoliad unrhyw gofnod ac o'r dudalen <2></2> gosodiadau

source: Swipe a location left and click edit <2></2> or delete<4></4> buttons.
cy: Sweipiwch leoliad i'r chwith a chlicio ar y botymau <2></2> golygu <4></4> neu ddileu.

source: You can make your location stick to the top of the locations list by clicking the Favourite toggle.
cy: Gallwch wneud i'ch lleoliad aros ar frig y rhestr o leoliadau drwy glicio ar y Togl Hoff.

source: Go to the application settings page <2></2> and click on the Reset <4></4> button.
cy: Ewch i dudalen gosodiadau'r ap <2></2> a chliciwch ar y botwm <4></4> Ailosod.

source: For more help please visit the iRecord <2>forum</2>.
cy: I gael rhagor o help, ewch i fforwm <2></2> iRecord.

source: breeding
cy: magu

source: Non-breeding
cy: Ddim yn magu

source: Possible breeding
cy: Yn magu o bosib

source: Probable breeding
cy: Yn magu fwy na thebyg

source: Confirmed breeding
cy: Magu wedi’i gadarnhau

source: Please pick the breeding details for this record.
cy: Dewiswch y manylion magu ar gyfer y cofnod hwn.

source: Not recorded
cy: Heb ei gofnodi

source: 00: Migration, Flying or Summering (M/F/U)
cy: 00: Mudo, Hedfan neu Dreulio’r Haf (M/F/U)

source: 01: Nesting habitat (H)
cy: 01: Cynefin nythu (H)

source: 02: Singing male (S)
cy: 02: Gwrywod yn canu (S)

source: 03: Pair in suitable habitat (P)
cy: 03: Pâr mewn cynefin addas (P)

source: 04: Permanent territory (T)
cy: 04: Tiriogaeth barhaol (T)

source: 05: Courtship and display (D)
cy: 05: Carwriaeth ac arddangosfa (D)

source: 06: Visiting probable nest site (N)
cy: 06: Ymweld â safle nythu tebygol (N)

source: 07: Agitated behaviour (A)
cy: 07: Ymddygiad anniddig (A)

source: 08: Brood patch on incubating adult (I)
cy: 08: Darn moel ar oedolyn sy’n incwbeiddio (I)

source: 09: Nest building (B)
cy: 09: Creu nyth (B)

source: 10: Distraction display (DD)
cy: 10: Arddangosfa tynnu sylw (DD)

source: 11: Used nest or eggshells (UN)
cy: 11: Nyth wedi’i defnyddio neu blisg wyau (UN)

source: 12: Recently fledged (FL)
cy: 12: Wedi hedfan y nyth yn ddiweddar (FL)

source: 13: Occupied nest (ON)
cy: 13: Nyth lawn (ON)

source: 14: Faecal sac or food (FF)
cy: 14: Sach carthion neu fwyd (FF)

source: 15: Nest with eggs (NE)
cy: 15: Nyth gydag wyau (NE)

source: 16: Nest with young (NY)
cy: 16: Nyth gyda chywion (NY)

source: Please log in first to upload the records.
cy: Mewngofnodwch i ddechrau i uwchlwytho’r cofnodion.

source: I agree to <2>Terms and Conditions</2> and <6>Privacy Policy</6>
cy: Rwyf yn cytuno i’r <2>Telerau ac Amodau</2> a’r <6>Polisi Preifatrwydd</6>

source: Please wait...
cy: Arhoswch...

source: characters
cy: nod

source: Ovip. scars
cy: Creithiau Ofip.

source: This attribute should be recorded for Willow Emerald only.
cy: Dim ond ar gyfer Fursen Werdd yr Helyg y dylai'r briodoledd hon yn cael ei chofnodi.

source: Done
cy: Wedi gorffen

source: Discard local data
cy: Taflu data lleol

source: Type in a species name (English or scientific name, or a genus or family etc.).
cy: Teipiwch enw rhywogaeth (enw Saesneg neu wyddonol, neu genws neu deulu ac ati).

source: To find a species from its scientific name you can use shortcuts, e.g. to find <2><i>Bellis perrenis</i></2> (Daisy) you can type:
cy: I ddod o hyd i rywogaeth oddi wrth ei henw gwyddonol gallwch ddefnyddio llwybrau byr, e.e. i ddod o hyd i <2><i>Bellis perrenis</i></2> (Llygad y dydd) gallwch deipio:

source: Click on the activity below which you would like to participate in.
cy: Cliciwch ar y gweithgaredd isod yr hoffech gymryd rhan ynddo.

source: Click on the activity below which you would like to participate in.<1><0><0>You can join in with more activities by visiting the <2>iRecord Activities</2> page.</0></0><1><0>Pull to refresh the list.</0></1><2><0>For more about Activities see the <2>iRecord Help</2> page.</0></2></1>
cy: Cliciwch ar y gweithgaredd isod yr hoffech gymryd rhan ynddo.<1><0><0>Gallwch ymuno â mwy o weithgareddau drwy fynd i'r dudalen <2>Gweithgareddau iRecord</2>.</0></0 <1><0>Tynnwch i adnewyddu'r rhestr.</0></1><2><0>Am ragor am Weithgareddau edrychwch ar y dudalen <2>Help iRecord</2>.</0></ 2></1>

source: READ MORE
cy: DARLLEN MWY

source: Got it
cy: Deall

source: You can join in with more activities by visiting the <1>iRecord Activities</1> page.
cy: Gallwch ymuno â rhagor o weithgareddau drwy fynd i'r dudalen <1>Gweithgareddau iRecord</1>.

source: For more about Activities see the <1>iRecord Help</1> page.
cy: Am fwy o wybodaeth am Weithgareddau edrychwch ar y dudalen <1>Help iRecord</1>.

source: Welcome back
cy: Croeso'n ôl

source: Sign in to your account to start
cy: Mewngofnodwch i'ch cyfrif i ddechrau

source: Sign In
cy: Mewngofnodi

source: I don't have an account
cy: Does gen i ddim cyfrif

source: Sign Up
cy: Cofrestrwch

source: Create a free account
cy: Creu cyfrif am ddim

source: First name
cy: Enw cyntaf

source: Last name
cy: Enw diwethaf

source: By clicking Sign Up, you agree to our <2>Privacy Policy</2> and <6>Terms and Conditions</6>
cy: Drwy glicio ar Cofrestru, rydych chi'n cytuno i'n <2>Polisi Preifatrwtdd</2> a'n <6>Telerau ac Amodau</6>

source: Welcome aboard
cy: Croeso mawr

source: Enter your email address to request a password reset.
cy: Nodwch eich cyfeiriad e-bost a gofyn am ailosod y cyfrinair.

source: iRecord App is an application that enables you to get involved in biological recording. You can contribute your sightings with photos, GPS acquired coordinates, descriptions and other information, thus providing scientists with important new biodiversity information that contributes to nature conservation, planning, research and education.'
cy: Mae Ap LERC Cymru yn ap sy'n eich galluogi i gymryd rhan mewn cofnodi biolegol. Gallwch gyfrannu'r hyn rydych wedi'i weld gyda ffotograffau, cyfesurynnau a gafwyd gan GPS, disgrifiadau a gwybodaeth arall, gan roi gwybodaeth bwysig newydd am fioamrywiaeth i wyddonwyr sy'n cyfrannu at gadwraeth natur, cynllunio, ymchwil ac addysg.

source: We encourage everyone to get involved with recording species as it is very easy and quick to submit useful records without specialist knowledge. It doesn't matter whether you are an amateur enthusiast or a qualified biologist, iRecord App is for anyone who wants to contribute to our database observations of the natural environment.'
cy: Rydym yn annog pawb i ymwneud â chofnodi rhywogaethau gan ei bod yn hawdd iawn ac yn gyflym i gyflwyno cofnodion defnyddiol heb wybodaeth arbenigol. Does dim ots a ydych chi'n amatur brwdfrydig neu'n fiolegydd cymwys, mae Ap LERC Cymru ar gyfer unrhyw un sydd eisiau cyfrannu at ein cronfa ddata o'r amgylchedd naturiol.

source: This app was hand crafted with love by<1> Flumens.</1> Agency specializing in building bespoke data oriented sollutions. For suggestions and feedback please do not hesitate to <5>contact us</5>.
cy: Cafodd yr ap hwn ei greu â llaw gyda chariad gan <1> Flumens.</1> Asiantaeth sy'n arbenigo mewn adeiladu datrysiadau pwrpasol sy'n canolbwyntio ar ddata. Am awgrymiadau ac adborth mae croeso i chi <5>gysylltu â ni</5>.

source: in the home page header. This will prompt you to select the photo source: camera or gallery. Once you have picked a photo, the app will create a new record without any species associated with it.
cy: ym mhennyn yr hafan. Bydd hyn yn eich annog i ddewis ffynhonnell y ffotograff: camera neu oriel. Unwaith y byddwch wedi dewis ffotograff, bydd yr ap yn creu cofnod newydd heb unrhyw rywogaethau yn gysylltiedig ag ef.

source: button in the home page. This will bring you to the taxa search page. After selecting the species, open the record (either by opening it directly from the taxa search page using the edit button
cy: botwm yn yr hafan. Bydd hyn yn dod â chi i'r dudalen chwilio tacsa. Ar ôl dewis y rhywogaeth, agorwch y cofnod (naill ai drwy ei agor yn uniongyrchol o'r dudalen chwilio tacsa gan ddefnyddio'r botwm golygu

source: When finished, press the Upload button in the record's page header.
cy: Ar ôl gorffen, pwyswch y botwm Uwchlwytho ym mhennyn tudalen y cofnod.

source: Adding lists of records - surveying
cy: Ychwanegu rhestrau o gofnodion - arolygu

source: You can record lists of species. Long-pressing the green plus button in the home page will show more advanced recording options.
cy: Gallwch gofnodi rhestrau o rywogaethau. Bydd gwasgu'r botwm plws gwyrdd yn hir ar yr hafan yn dangos opsiynau cofnodi mwy datblygedig.

source: To find a species from its scientific name you can use shortcuts, e.g. to find<1><i> Bellis perrenis</i></1> (Daisy) you can type:
cy: I ddod o hyd i rywogaeth oddi wrth ei henw gwyddonol gallwch ddefnyddio llwybrau byr, e.e. i ddod o hyd i <1><i> Bellis perrenis</i></1> (Llygad y dydd) gallwch deipio:

source: Once you have added the name, you can add a photo, and the app will suggest an identification based on the photo.
cy: Unwaith y byddwch wedi ychwanegu'r enw, gallwch ychwanegu ffotograff, a bydd yr ap yn awgrymu dull adnabod yn seiliedig ar y ffotograff.

source: Image recognition
cy: Adnabod llun

source: If you have added a photo to your record, the app will offer suggestions about the identification, using automatic image recognition.
cy: Os ydych chi wedi ychwanegu ffotograff at eich cofnod, bydd yr ap yn cynnig awgrymiadau am ei adnabod, gan ddefnyddio system adnabod lluniau awtomatig.

source: If you add a record using the plus button, you will be asked to add a species name to your record first. You can then add one or more photos, and the app will tell you if it agrees with the species name. If not it may suggest a different identification.
cy: Os byddwch yn ychwanegu cofnod gan ddefnyddio'r botwm plws, gofynnir i chi ychwanegu enw rhywogaeth at eich cofnod yn gyntaf. Wedyn gallwch chi ychwanegu un neu fwy o ffotograffau, a bydd yr ap yn dweud wrthych chi a yw'n cytuno ag enw'r rhywogaeth. Os nad yw, gall awgrymu dull adnabod gwahanol.

source: If you add a record using the photo button, you can add a photo first, and the app will be able to suggest an identification. You can then go on to use the suggested species name if you agree with it, or add your own identification instead.
cy: Os ydych chi'n ychwanegu cofnod gan ddefnyddio'r botwm ffotograff, gallwch chi ychwanegu ffotograff yn gyntaf, a bydd yr ap yn gallu awgrymu dull adnabod. Wedyn gallwch fynd ymlaen i ddefnyddio'r enw rhywogaeth a awgrymir os ydych yn cytuno ag ef, neu ychwanegu eich dull adnabod eich hun yn lle hynny.

source: After uploading the photo, check the thumbnail to see if it shows a percentage indicating the probability of a suggested identification. If a different identification is being suggested a small red warning circle will be displayed – open the thumbnail to see alternative identification suggestions.
cy: Ar ôl uwchlwytho'r ffotograff, gwiriwch y cryno-lun i weld a yw'n dangos canran sy'n nodi tebygolrwydd unrhyw adnabod a awgrymir. Os yw dull adnabod gwahanol yn cael ei awgrymu, bydd cylch rhybudd coch bach yn cael ei arddangos – agorwch y cryno-lun i weld yr awgrymiadau adnabod amgen.

source: Identification agreed
cy: Cytunwyd ar adnabod

source: Alternative Identification suggested
cy: Awgrymwyd adnabod amgen

source: When you open up the thumbnail image you can tap on any of the alternative suggestions shown, and that will set the identification for your record.
cy: Pan fyddwch chi'n agor y cryno-lun gallwch chi dapio ar unrhyw un o'r awgrymiadau amgen a ddangosir, a bydd hynny'n gosod yr adnabod ar gyfer eich cofnod.

source: The image recognition process can be very helpful, but it doesn’t get it right every time! Check what is being suggested before making your final decision, and if you think the app suggestion is wrong feel free to stick to your own identification.
cy: Gall y broses adnabod lluniau fod yn ddefnyddiol iawn, ond nid yw'n gywir bob tro! Gwiriwch beth sy'n cael ei awgrymu cyn gwneud eich penderfyniad terfynol, ac os ydych chi'n meddwl bod awgrym yr ap yn anghywir, mae croeso i chi gadw at eich dewis chi.

source: mode until it is set for upload. While it is in
cy: modd nes ei fod wedi'i osod i'w uwchlwytho. Tra mae yn y

source: mode the application will not synchronise your record with the database.
cy: modd ni fydd y rhaglen yn cysoni eich cofnod gyda'r gronfa ddata.

source: To set it for upload, open the record and press the Upload button in the header. The application will try to submit your record once there is a good network connection.
cy: I'w osod i'w uwchlwytho, agorwch y cofnod a gwasgwch y botwm Uwchlwytho yn y pennyn. Bydd y cais yn ceisio cyflwyno'ch cofnod unwaith y bydd cysylltiad rhwydwaith da.

source: If the record has reached the database, it will be moved to the Uploaded list in the Home page (see Uploaded tab).
cy: Os yw'r cofnod wedi cyrraedd y gronfa ddata, bydd yn cael ei symud i'r rhestr Wedi'i Uwchlwytho yn yr Hafan (edrychwch ar y tab Wedi'i Uwchlwytho).

source: To delete a record, swipe it left in the Home page and click the delete
cy: I ddileu cofnod, sweipiwch ef i'r chwith yn yr Hafan a chliciwch ar dileu

source: To lock an attribute swipe the menu attribute item to the left and click on the lock
cy: I gloi nodwedd, sweipiwch yr eitem nodwedd dewislen i'r chwith a chliciwch ar y botwm

source: button. This will change the symbol to locked
cy: clo. Bydd hyn yn newid y symbol i gloi

source: To send records to a specific activity you can select it in the Activities page.
cy: I anfon cofnodion i weithgaredd penodol gallwch ei ddewis yn y dudalen Gweithgareddau.

source: You can manage your saved locations both on any record's location page and from the settings page.
cy: Gallwch reoli eich lleoliadau sydd wedi'u cadw ar dudalen lleoliad unrhyw gofnod ac o'r dudalen gosodiadau.

source: The <2>Biological Records Centre</2> (BRC), established in 1964, is a national focus in the UK for terrestrial and freshwater species recording. BRC works closely with the voluntary recording community, principally through support of national recording schemes and societies. BRC is supported by the Joint Nature Conservation Committee (JNCC) and the UK Centre for Ecology & Hydrology (UKCEH). The work of BRC is a major component of the National Biodiversity Network (NBN).
cy: Mae'r <2>Ganolfan Cofnodion Biolegol</2> (BRC), a sefydlwyd yn 1964, yn ffocws cenedlaethol yn y DU ar gyfer cofnodi rhywogaethau'r tir a dŵr croyw. Mae BRC yn gweithio'n agos gyda'r gymuned gofnodi wirfoddol, yn bennaf drwy gefnogi cynlluniau a chymdeithasau cofnodi cenedlaethol. Cefnogir BRC gan y Cydbwyllgor Cadwraeth Natur (JNCC) a Chanolfan Ecoleg a Hydroleg y DU (UKCEH). Mae gwaith BRC yn elfen bwysig o'r Rhwydwaith Bioamrywiaeth Cenedlaethol (NBN).
