Repository: NERC-CEH/lerc-wales-app
Catalog: src/common/translations/interface/*.po
Languages: cy

source: Location
cy: Lleoliad

source: Date
cy: Dyddiad

source: Edit
cy: Golygu

source: Login
cy: Mewngofnodi

source: Register
cy: Cofrestru

source: Settings
cy: Gosodiadau

source: App
cy: Ap

source: Info
cy: Gwybodaeth

source: About
cy: Cefndir

source: Privacy Policy
cy: Polisi Preifatrwydd

source: BRC Approved
cy: Cymeradwywyd gan BRC

source: Credits
cy: Cydnabyddiaeth

source: LERC Wales
cy: LERC Cymru

source: Reset
cy: Ailosod

source: Records
cy: Cofnodion

source: Training Mode
cy: Dull Hyfforddi

source: Use Grid Ref
cy: Defnyddio Cyfeirnod Map

source: Show Map Grid
cy: Dangos Grid Map

source: Manage Saved
cy: Rheoli Pob Lleoliad a Gadwyd

source: Grid Square Unit
cy: Uned Sgwâr Grid

source: Application
cy: Defnydd

source: Language
cy: Iaith

source: Experimental Features
cy: Nodweddion Arbrofol

source: Here you can select or swipe to edit your previous locations
cy: Yma cewch ddewis neu sweipio i olygu eich lleoliadau blaenorol

source: source
cy: ffynhonnell

source: Past Locations
cy: Lleoliadau Blaenorol

source: Please pick your grid square unit.
cy: Dewiswch eich uned sgwâr grid

source: Tetrad (2km square)
cy: Tetrad (sgwâr 2km)

source: Monad (1km square)
cy: Monad (sgwâr 1km)

source: The LERC Wales mobile application enables you to get involved in biological recording in Wales. You can contribute your sightings with photos, GPS acquired coordinates, descriptions and other information, thus providing scientists with important new biodiversity information that contributes to nature conservation, planning, research and education.
cy: Mae ap symudol LERC Cymru yn galluogi i chi gymryd rhan mewn cofnodion biolegol yng Nghymru. Gallwch gyfrannu popeth rydych yn ei weld gyda lluniau, cyfesurynnau GPS, disgrifiadau a gwybodaeth arall, gan ddarparu gwybodaeth newydd bwysig i wyddonwyr am fioamrywiaeth a chyfrannu at gadwraeth, cynlluniau, ymchwil ac addysg natur.

source: This app was developed by the BRC mobile development team on behalf of the Local Environmental Record Centres in Wales. For suggestions and feedback please do not hesitate to
cy: Datblygwyd yr ap yma gan dîm datblygu symudol BRC ar ran Canolfan Cofnodion Amgylcheddol Lleol Cymru. Am awgrymiadau ac adborth, cofiwch

source: Local Environmental Records Centres Wales
cy: Canolfan Cofnodion Amgylcheddol Lleol Cymru

source: The Local Environmental Records Centres Wales
cy: Mae Canolfan Cofnodion Amgylcheddol Lleol Cymru

source: is a consortium made up of the four Records Centres in Wales
cy: yn gonsortiwm sy'n cynnwys y pedair Ganolfan Cofnodion yng Nghymru.

source: We work closely together to provide a seamless service for the data users in Wales and to support the voluntary recording community across the principality
cy: Rydym yn cydweithio'n agos er mwyn darparu gwasanaeth di-dor ar gyfer defnyddwyr y data yng Nghymru ac i gefnogi'r gymuned gofnodi wirfoddol ledled y wlad

source: Who can use the app?
cy: Pwy sy'n gallu defnyddio'r ap?

source: App Development
cy: Datblygu'r Ap

source: contact us
cy: gysylltu â ni

source: How to make a new record
cy: Sut i wneud cofnod newydd

source: There are two ways to start a record
cy: Mae dwy ffordd i ddechrau cofnod

source: Taking a photo
cy: Tynnu llun

source: Selecting species
cy: Dewis rhywogaethau

source: Searching for species
cy: Chwilio am rywogaethau

source: Sync. with iRecord
cy: Cysoni ag iRecord

source: iRecord Website
cy: Wefan iRecord

source: Delete a record
cy: Dileu cofnod

source: Lock an attribute
cy: Cloi nodwedd

source: You can lock record attributes like date, location, number etc, which will preserve your current attribute value for the subsequently added records
cy: Gallwch gloi nodweddion cofnod fel dyddiad, lleoliad, niferoedd ac ati, a fydd yn gwarchod eich gwerth nodwedd gyfredol ar gyfer y cofnodion a ychwanegir wedyn

source: User
cy: Defnyddiwr

source: Sign in/out or register
cy: Mewngofnodi/Allgofnodi neu gofrestru

source: Activities
cy: Gweithgareddau

source: Pull to refresh the list.
cy: Tynnwch i adnewyddu’r rhestr

source: Sorry, no activities data is available at the moment.
cy: Mae’n ddrwg gennym. Nid oes data am weithgareddau ar gael ar hyn o bryd.

source: Other
cy: Arall

source: Manage saved locations
cy: Rheoli lleoliadau a gadwyd

source: You can manage your saved locations both on any record's location page and from the settings page
cy: Gallwch reoli eich lleoliadau a gadwyd ar dudalen lleoliad unrhyw gofnod ac o'r dudalen gosodiadau

source: Swipe a location left and click edit
cy: Rhaid sweipio lleoliad i'r chwith a chlicio ar golygu

source: Reset the application
cy: Ailosod yr ap

source: Wherever you see this logo on a biological recording app you can be assured that the data you submit will be: made available to experts for quality assurance; made available for conservation and research and preserved for long-term use.
cy: Os gwelwch chi'r logo yma ar ap cofnodion biolegol gallwch fod yn sicr y bydd y data rydych yn eu cyflwyno: ar gael i arbenigwyr ar gyfer sicrhau eu hansawdd; ar gael i gadwraeth ac ymchwil ac yn cael eu gwarchod ar gyfer defnydd tymor hir.

source: This logo indicates that your data is
cy: Mae'r logo yma'n dangos bod eich data'n

source: Sent to the Biological Record Centre’s data warehouse linked to the iRecord system where it accessible to you as the recorder, to an expert community of verifiers and other users of iRecord
cy: cael eu hanfon i warws data'r Ganolfan Cofnodion Biolegol yn gysylltiedig â'r system iRecord lle maent ar gael i chi fel y cofnodwr, i gymuned arbenigol o ddilyswyr ac i ddefnyddwyr eraill iRecord

source: Quality assured data is passed onto Local Environmental Records Centres, National Recording Schemes and to the NBN Gateway
cy: Mae data y mae eu hansawdd wedi'i sicrhau'n cael eu hanfon ymlaen i'r Canolfannau Cofnodion Amgylcheddol Lleol, i'r Cynlluniau Cofnodi Cenedlaethol ac i Borth NBN

source: About BRC
cy: Cefndir BRC

source: established in 1964, is a national focus in the UK for terrestrial and freshwater species recording. BRC works closely with the voluntary recording community, principally through support of national recording schemes and societies. BRC is supported by the Joint Nature Conservation Committee (JNCC) and the Centre for Ecology & Hydrology (CEH) within the Natural Environment Research Council (NERC). The work of BRC is a major component of the National Biodiversity Network (NBN)
cy: Wedi'i sefydlu yn 1964, mae'n ffocws cenedlaethol yn y DU ar gyfer cofnodi rhywogaethau tir a dŵr croyw. Mae BRC yn gweithio'n agos â'r gymuned gofnodi wirfoddol, yn bennaf drwy gefnogi cynlluniau a chymdeithasau cofnodi cenedlaethol. Cefnogir BRC gan y Cydbwyllgor Cadwraeth Natur (JNCC) a'r Ganolfan ar gyfer Ecoleg a Hydroleg (CEH) yn y Cyngor Ymchwil ar gyfer yr Amgylchedd Naturiol (NERC). Mae gwaith BRC yn elfen bwysig o'r Rhwydwaith Bioamrywiaeth Cenedlaethol (NBN)

source: Which app should I use?
cy: Pa ap ddylwn i ei ddefnyddio?

source: You might have noticed that several of
cy: Efallai eich bod wedi sylwi bod nifer o

source: BRC apps
cy: apiau BRC

source: feature some of the same species? We have introduced the BRC Approved logo to signify that data from our apps all go to the same place. Therefore, you are free to choose which app you use to record a given species. All records will be sent to the same place, treated in the same way and will meet the established standards required by the Biological Record Centre
cy: yn cynnwys rhai o'r un rhywogaethau? Rydym wedi cyflwyno'r logo Cymeradwywyd gan BRC i ddynodi bod data pob ap gennym yn mynd i'r un lle. Felly mae croeso i chi ddewis pa ap rydych yn ei ddefnyddio i gofnodi rhywogaeth benodol. Anfonir pob cofnod i'r un lle, byddant yn cael eu trin yr un fath ac yn bodloni'r safonau wedi'u sefydlu sy'n ofynnol gan y Ganolfan Cofnodion Biolegol.

source: Welcome screen credits
cy: Cydnabyddiaeth y sgrin groeso

source: Species
cy: Rhywogaethau

source: date
cy: dyddiad

source: Unlocked
cy: Datglowyd

source: Please add any extra info about this record.
cy: Ychwanegwch unrhyw wybodaeth ychwanegol am y cofnod yma.

source: comment
cy: sylw

source: Please pick the life stage.
cy: Dewiswch y cyfnod bywyd.

source: Not Recorded
cy: Heb Gofnodi

source: Adult
cy: Oedolyn

source: Pre-adult
cy: Cyn-oedolyn

source: stage
cy: oedolyn

source: If another person identified the species for you, please enter their name here.
cy: Os mai person arall wnaeth adnabod y rhywogaeth i chi, rhowch ei enw yma.

source: identifiers
cy: adnabyddwr

source: Abundance
cy: Niferoedd

source: Stage
cy: Cam

source: Identified by
cy: Wedi'i adnabod gan

source: Present
cy: Presennol

source: Password
cy: Cyfrinair

source: Email
cy: E-bost

source: No photo has been added.<br/>Press <3></3> to add.
cy: Does dim ffotograff wedi ei ychwanegu.<br/>Pwyswch <3></3> i'w ychwanegu.

source: acarine
cy: acarin

source: acorn worm
cy: mes-lynghyren

source: alderfly
cy: pryf y wernen

source: amphibian
cy: amffibiad

source: annelid
cy: anelid

source: arrow worm
cy: saeth-lynghyren

source: bacterium
cy: bacteriwm

source: beardworm
cy: barf-lynghyren

source: beetle
cy: chwilen

source: bird
cy: aderyn

source: bony fish
cy: pysgodyn esgyrnog

source: booklouse
cy: lleuen llyfrau

source: bristletail
cy: sioncyn gwrychog

source: bryozoan
cy: bryosoad

source: butterfly
cy: glöyn byw

source: caddis fly
cy: pryf caddis

source: cartilagenous fish
cy: pysgodyn cartilagaidd

source: centipede
cy: neidr gantroed

source: chromist
cy: cromist

source: clubmoss
cy: cnwpfwsogl

source: cockroach
cy: cocrotsien

source: coelenterate
cy: selenteriad

source: comb jelly
cy: slefren gribog

source: conifer
cy: conwydd

source: crustacean
cy: cramennog

source: cycliophoran
cy: sycliofforan

source: dragonfly
cy: gwas y neidr

source: earwig
cy: pryf clustiog

source: echinoderm
cy: ecinoderm

source: false scorpion
cy: sgorpion ffug

source: fern
cy: rhedynen

source: flatworm
cy: llynghyren ledog

source: flea
cy: chwannen

source: flower. plant
cy: blodyn. planhigyn

source: foraminiferan
cy: fforaminiffer

source: fungoid
cy: ffyngoid

source: fungus
cy: ffwng

source: ginkgo
cy: coeden ginco

source: gnathostomulid
cy: nathostomwlid

source: hairworm
cy: blewlynghyren

source: harvestman
cy: llynghyren y cynhaeaf

source: hornwort
cy: cyrnddail

source: horseshoe worm
cy: pedol-lynghyren

source: horsetail
cy: cynffon ceffyl

source: jawless fish
cy: pysgodyn heb ên

source: lacewing
cy: adain siderog

source: lampshell
cy: braciopod

source: lancelet
cy: pysgodyn pengoll

source: lichen
cy: cen

source: liverwort
cy: llysiau'r afu

source: loriciferan
cy: lorisiffer

source: louse
cy: lleuen

source: mammal
cy: mamal

source: marine mammal
cy: mamal y môr

source: mayfly
cy: cylionyn Mai

source: mesozoan
cy: mesosoad

source: millipede
cy: neidr filtroed

source: mollusc
cy: molwsg

source: monogenean
cy: monogenead

source: moss
cy: mwsogl

source: moth
cy: gwyfyn

source: mud dragon
cy: draig y llaid

source: pauropod
cy: pawropod

source: peanut worm
cy: llynghyren pysgnau

source: priapulid
cy: priapwlid

source: protozoan
cy: protosoan

source: proturan
cy: protwran

source: quillwort
cy: gwair merllyn

source: reptile
cy: ymlusgiad

source: ribbon worm
cy: rhuban-lynghyren

source: rotifer
cy: rhodfilyn

source: roundworm
cy: llynghyren gron

source: scorpion
cy: sgorpion

source: scorpion fly
cy: pryf sgorpion

source: sea spider
cy: pryf copyn y môr

source: silverfish
cy: pysgodyn arian

source: slime mould
cy: llwydni llysnafedd

source: snakefly
cy: pryf gyddfog

source: spider
cy: pryf copyn

source: sponge
cy: sbwng

source: spoon worm
cy: llwy-lynghyren

source: springtail
cy: cynffon sbonc

source: stick insect
cy: pryf pric

source: stonefly
cy: pryf y cerrig

source: stonewort
cy: rhawn yr ebol

source: symphylan
cy: symffylan

source: tapeworm
cy: llynghyren rhuban

source: thorny-headed worm
cy: llynghyren ddreiniog

source: trematode
cy: trematod

source: true bug
cy: gwir leuen

source: true fly
cy: gwir bryf

source: tunicate
cy: chwistrell

source: two-tailed bristletail
cy: sioncyn gwrychog dwy gynffon

source: unassigned
cy: heb neilltuo

source: undetermined
cy: heb benderfynu

source: waterbear
cy: copyn blewog

source: Comment
cy: Sylw

source: Filters
cy: Ffilterau

source: Close
cy: Cau

source: How many individuals of this type?
cy: Faint o unigolion o'r math yma?

source: How many individuals of this species did you see?
cy: Faint o unigolion o'r rhywogaeth yma welsoch chi?

source: Yikes!
cy: Rargol!

source: OK
cy: Iawn

source: Cancel
cy: Canslo

source: Edit Location
cy: Golygu Lleoliad

source: Save
cy: Cadw

source: Delete
cy: Dileu

source: Refresh
cy: Adnewyddu

source: Are you sure you want to reset the application to its initial state?
cy: Ydych chi'n siŵr eich bod eisiau ailosod yr ap i'w gyflwr gwreiddiol?

source: This will wipe all the locally stored app data!
cy: Bydd hyn yn dileu'r holl ddata sydd wedi'u storio'n lleol yn yr ap!

source: Submit
cy: Cyflwyno

source: Remove All
cy: Dileu Pob Un

source: Remove
cy: Dileu

source: No previous locations
cy: Dim lleoliadau blaenorol

source: Are you sure you want to set all valid records for submission?
cy: Ydych chi'n siŵr eich bod eisiau gosod yr holl gofnodion dilys ar gyfer eu cyflwyno?

source: Are you sure you want to remove all successfully synchronised local records?
cy: Ydych chi'n siŵr eich bod eisiau dileu'r holl gofnodion lleol sydd wedi'u cysoni'n llwyddiannus?

source: records on the server will not be touched.
cy: ni fydd cofnodion ar y gweinydd yn cael eu cyffwrdd.

source: Training
cy: Hyfforddiant

source: No location name
cy: Dim enw lleoliad

source: Name missing
cy: Enw ar goll

source: Please log in to the app before selecting an alternative activity for your records.
cy: Mewngofnodwch i'r ap cyn dewis gweithgaredd arall ar gyfer eich cofnodion.

source: Let's add one!
cy: Beth am ychwanegu un!

source: Species name
cy: Enw'r rhywogaeth

source: No location
cy: Dim lleoliad

source: Sorry
cy: Sori

source: Welcome
cy: Croeso

source: OK, got it
cy: Iawn

source: Species missing
cy: Dim enw rhywogaeth

source: Locating
cy: Yn lleoli

source: will become green
cy: bydd yn troi'n wyrdd

source: synced to the database
cy: wedi'i gysoni â'r bas data

source: Looks like you are offline!
cy: Rydych chi oddi ar-lein mae'n debyg!

source: Today
cy: Heddiw

source: Locked
cy: Wedi cloi

source: Grid reference
cy: Cyfeirnod grid

source: Nearest named place
cy: Lle agosaf wedi'i enwi

source: Default
cy: Diofyn

source: Site type
cy: Math o safle

source: Adults
cy: Oedolion

source: Cop. pairs
cy: Parau cop.

source: Ovip. females
cy: Benywod Ovip.

source: Larvae
cy: Larfa

source: Exuviae
cy: Hengroen

source: Emergents
cy: Yn ymddangos

source: Lake
cy: Llyn

source: Reservoir
cy: Cronfa ddŵr

source: Mill lodge
cy: Llety melin

source: Large pond
cy: Pwll mawr

source: Small pond
cy: Pwll bach

source: Garden pond
cy: Pwll gardd

source: River
cy: Afon

source: Stream
cy: Nant

source: Ditch
cy: Ffos

source: Canal
cy: Camlas

source: Other (please specify in comments)
cy: Arall (nodwch gyda sylwadau)

source: Habitat
cy: Cynefin

source: Microscopically Checked
cy: Archwiliwyd dan ficrosgop

source: Fruit
cy: Ffrwyth

source: Male
cy: Gwryw

source: Female
cy: Benyw

source: Bulbils
cy: Bylbynnau

source: Gemmae
cy: Blagur

source: Tubers
cy: Cloron

source: Arable land, gardens or parks
cy: Tir âr, gerddi neu barciau

source: Bogs and fens
cy: Corsydd a ffeniau

source: Coast
cy: Arfordir

source: Grassland
cy: Glaswelltir

source: Heathland, scrub, hedges
cy: Rhostir, prysgwydd, gwrychoedd

source: Industrial and urban
cy: Diwydiannol a threfol

source: Inland water
cy: Dŵr mewndirol

source: Mixed habitats
cy: Cynefinoedd cymysg

source: Unvegetated or sparsely vegetated habitats
cy: Cynefinoedd heb lystyfiant neu'r llystyfiant yn brin

source: Woodland
cy: Coetir

source: missing
cy: dim enw

source: Are you sure you want to remove this photo from the sample?
cy: Ydych chi'n siŵr eich bod eisiau tynnu'r llun yma o'r sampl?

source: </br><i><b>Note:</b> it will remain in the gallery.</i>
cy: </br><i><b>Sylwer:</b> bydd yn aros yn yr oriel.</i>

source: Choose a method to upload a photo
cy: Dewiswch ddull i uwchlwytho llun

source: Gallery
cy: Oriel

source: Logout
cy: Allgofnodi

source: Statistics
cy: Ystadegau

source: Top species
cy: Prif rywogaethau

source: Activity
cy: Gweithgaredd

source: location name
cy: enw'r lleoliad

source: location
cy: lleoliad

source: Record
cy: Cofnod

source: This record has been submitted and cannot be edited within this App.
cy: Mae'r cofnod hwn wedi'i gyflwyno ac ni ellir ei olygu yn yr Ap hwn.

source: No species found with this name
cy: Dim rhywogaethau wedi'u canfod gyda'r enw hwn

source: Sorry, we have encountered a problem while sending the record.
cy: Rydym wedi dod ar draws problem wrth anfon y cofnod

source: Success
cy: Llwyddiant

source: Further instructions have been sent to your e-mail address.
cy: Cyfarwyddiadau pellach wedi'u hanfon at eich cyfeiriad ebost.

source: Before submitting any records please check your email and click on the verification link.
cy: Cyn cyflwyno unrhyw gofnodion, edrychwch ar eich e-bost a chliciwch ar y ddolen wirio.

source: Are you sure you want to logout?
cy: A ydych yn sicr eich bod am allgofnodi?

source: Incorrect password or email.
cy: Cyfrinair neu ebost anghywir.

source: Invalid date selected
cy: Dyddiad annilys wedi'i ddewis

source: Are you sure you want to remove this record from your device?</br><i><b>Note:</b> it will remain on the server.</i>
cy: A ydych yn sicr eich bod am ddileu'r cofnod hwn o'ch dyfais?<br /><i><b>Noder: Bydd o'n aros ar y gweinydd.</b>

source: The development was led by SEWBReC, and was jointly funded by BIS, WWBIC and Cofnod.
cy: Arweiniwyd y datblygiad gan SEWBReC, a chafodd ei ariannu ar y cyd gan BIS, WWBIC a Cofnod.

source: Also thanks to all the beta testers and the rest of the LERC Wales staff for their input.
cy: Hefyd diolch i'r holl brofwyr beta a gweddill y staff LERC Cymru am eu cyfraniad.

source: Enjoying the app?
cy: ‘Dych chi’n mwynhau’r ap?

source: Not really
cy: Dim rili

source: Yes!
cy: Ydw!

source: Would you mind giving us some feedback?
cy: Fyddech chi’n meddwl rhoi tipyn o adborth i ni?

source: No, thanks
cy: Dim diolch

source: OK, sure
cy: Iawn, siwr

source: How about a rating on the App Store then?
cy: Beth am raddio ni ar App Store wedyn?

source: How about a rating on the Play Store then?
cy: Beth am raddio ni ar Play Store wedyn?

source: Forgot password?
cy: Ailosod

source: We are very grateful for all the people that helped to create this app:
cy: Rydym yn ddiolchgar iawn i bawb sydd wedi helpu i greu'r ap yma

source: Names:
cy: Enwau:

source: Common only
cy: Cyffredin yn unig

source: Scientific only
cy: Gwyddonol yn unig

source: Taxon groups:
cy: Grŵpiau Tacson

source: You have no previous locations.
cy: Nid oes gennych unrhyw leoliadau blaenorol

source: Sex
cy: Rhyw

source: Mixed
cy: Cymysg

source: Please indicate the sex of the organism.
cy: Nodwch ryw yr organeb

source: Eggs
cy: Wyau

source: Pupae
cy: Chwilerod

source: Larval webs
cy: Gweoedd larfal

source: Not selected
cy: Heb ddewis

source: Send
cy: Cyflwyno

source: Share App Analytics
cy: Anfon Ap Analytics

source: Delete all the locally stored app data.
cy: Dileu holl ddata sydd wedi'u storio'n lleol yn yr ap.

source: Home
cy: Cartref

source: Photo
cy: Llun

source: Menu
cy: Dewislen

source: Tip: Adding Observations
cy: Cyngor: Ychwanegu Sylwadau

source: Tap on the <ion-icon class="tip-icon" src="/images/ios-add.svg"></ion-icon> button to capture a new record.
cy: Tapiwch ar y botwm <ion-icon class="tip-icon" src="/images/ios-add.svg"></ion-icon> i gofnodi cofnod newydd.

source: Pending
cy: Yn aros

source: Uploaded
cy: Uwchlwythwyd

source: No finished pending records
cy: Dim cofnodion yn aros gorffenedig

source: No uploaded surveys
cy: Dim arolygon wedi’u huwchlwytho

source: Back
cy: Yn ôl

source: cyanobacterium
cy: syanobacteriwm

source: web-spinner
cy: troellwr gwe

source: Upload
cy: Uwchlwytho

source: Grid Reference
cy: Cyfeirnod Grid

source: Nearest named place (e.g town, park)
cy: Y lle agosaf gydag enw (e.e tref, parc)

source: Name
cy: Enw

source: Your location name
cy: Enw eich lleoliad

source: Enter more information here...
cy: Nodwch fwy o wybodaeth yma ...

source: Breeding
cy: Magu

source: Draft
cy: Drafft

source: This record hasn't been uploaded to the database yet. Are you sure you want to remove it from your device?
cy: Nid yw’r cofnod hwn wedi cael ei uwchlwytho i’r bas data eto. Ydych chi’n siŵr eich bod eisiau ei ddileu o’ch dyfais?

source: Enter your username or email address to request a password reset.
cy: Nodwch eich enw defnyddiwr neu eich cyfeiriad e-bost i wneud cais am ailosod cyfrinair.

source: Locations should be represented as UK Grid Reference instead of Latitude and Longitude.
cy: Dylid cynrychioli lleoliadau fel Cyfeirnod Grid yn y DU yn lle Lledred a Hydred.

source: Show UK Grid Reference over the map.
cy: Dangos Cyfeirnod Grid yn y DU dros y map.

source: Mark any new records as 'training' and exclude from all reports.
cy: Marcio unrhyw gofnodion newydd fel ‘hyfforddiant’ ac eithrio o bob adroddiad.

source: Share app crash data so we can make the app more reliable.
cy: Rhannu data am ap yn gwrthod gweithio er mwyn gallu gwneud yr ap yn fwy dibynadwy.

source: A technical consultancy that excels at building bespoke environmental science and community focussed solutions.
cy: Ymgynghoriaeth dechnegol sy’n rhagori mewn creu datrysiadau gwyddoniaeth amgylcheddol pwrpasol a gyda ffocws ar y gymuned.

source: For suggestions and feedback please do not hesitate to
cy: Ar gyfer awgrymiadau ac adborth, peidiwch ag oedi i

source: Quality assured data is passed onto Local Environmental Records Centres, National Recording Schemes and to the NBN Atlas
cy: Anfonir data gyda’u hansawdd wedi’i sicrhau at Ganolfannau Cofnodion Amgylcheddol Lleol, Cynlluniau Cofnodi Cenedlaethol ac i Atlas yr NBN

source: number
cy: nifer

source: Are you sure you want to remove this photo?
cy: Ydych chi’n siŵr eich bod chi eisiau dileu’r ffotograff yma?

source: Note: it will remain in the gallery.
cy: Sylwer: bydd yn aros yn yr oriel.

source: sex
cy: rhyw

source: Tip: Locking Attributes
cy: Cyngor: Cloi Nodweddion

source: You can preserve your current attribute value for the subsequently added records by locking it. Click on the <ion-icon src="/images/ios-lock.svg"></ion-icon> button.
cy: Gallwch warchod eich nodwedd gwerth bresennol ar gyfer y cofnodion a ychwanegir yn ddilynol drwy ei chloi. Cliciwch ar y botwm <ion-icon src="/images/ios-lock.svg"></ion-icon>.

source: Other recording options
cy: Opsiynau cofnodi eraill

source: Species List Survey
cy: Arolwg Rhestr Rhywogaethau

source: Hide
cy: Cuddio

source: To delete any surveys swipe it to the left.
cy: I ddileu unrhyw arolygon, sweipiwch i'r chwith.

source: Press the camera button <2></2> in the home page header. This will prompt you to select the photo source: camera or gallery. Once you have picked a photo, the app will create a new record without any species associated with it.
cy: Pwyswch y botwm camera <2></2> ym mhennyn yr hafan. Bydd hyn yn eich annog i ddewis ffynhonnell y ffotograff: camera neu oriel. Unwaith y byddwch wedi dewis ffotograff, bydd yr ap yn creu cofnod newydd
