Repository: NERC-CEH/lerc-wales-app
Catalog: src/common/translations/interface/*.po
Languages: cy

source: You might have noticed that several of <2>BRC apps</2> feature some of the same species? We have introduced the BRC Approved logo to signify that data from our apps all go to the same place. Therefore, you are free to choose which app you use to record a given species. All records will be sent to the same place, treated in the same way and will meet the established standards required by the Biological Record Centre.
cy: Efallai eich bod wedi sylwi bod nifer o <2>apiau BRC</2> yn cynnwys rhai o'r un rhywogaethau? Rydym wedi cyflwyno'r logo Cymeradwywyd gan BRC i ddangos bod data o'n apiau i gyd yn mynd i'r un lle. Felly, rydych chi'n rhydd i ddewis pa ap rydych chi'n ei ddefnyddio i gofnodi rhywogaeth benodol. Bydd yr holl gofnodion yn cael eu hanfon i'r un lle, yn cael eu trin yn yr un modd a byddant yn bodloni'r safonau sydd wedi'u sefydlu sy'n ofynnol gan y Ganolfan Cofnodion Biolegol.

source: This app was part-funded by the <2>UK Centre for Ecology & Hydrology</2>/<4>Joint Nature Conservation Committee</4> partnership supporting BRC.
cy: Mae'r ap yma wedi'i gyllido'n rhannol gan bartneriaeth <2>Canolfan Ecoleg a Hydroleg y DU</2>/<4>Cydbwyllgor Cadwraeth Natur</4> sy’n cefnogi BRC.

source: Icons were made by
cy: Gwnaed yr eiconau gan

source: Geolocate Survey Entries
cy: Cofnodion Arolwg Geoleoliad

source: Suggest species
cy: Awgrymu rhywogaethau

source: Use image recognition to identify species from your photos.
cy: Defnyddio adnabod llun i adnabod rhywogaeth oddi wrth eich ffotograffau.

source: Some features are in a trial state and are subject to change in future releases.
cy: Mae rhai nodweddion mewn cyfnod arbrawf a gallant newid mewn datganiadau yn y dyfodol.

source: Remove Uploaded Surveys
cy: Dileu Arolygon Wedi'u Huwchlwytho

source: You can remove uploaded surveys from this device.
cy: Gallwch ddileu arolygon sydd wedi'u huwchlwytho o'r ddyfais yma.

source: Reset app
cy: Ailosod yr ap

source: You can reset the app data to its default settings.
cy: Gallwch ailosod data'r ap i'w osodiadau diofyn.

source: Are you sure you want to remove all successfully synchronised local records?<p><i><b>Note:</b> records on the server will not be touched.</i></p>
cy: Ydych chi'n siŵr eich bod chi eisiau cael gwared ar yr holl gofnodion lleol sydd wedi'u cysoni'n llwyddiannus?<p><i><b>Sylwer: ni fydd</b> cofnodion ar y gweinydd yn cael eu cyffwrdd.</i></p>

source: <0>You have no finished surveys.<br/><br/>Press <4></4> to add record details, or press <6></6> to add a photo first.</0>
cy: <0>Nid oes gennych unrhyw arolygon gorffenedig.<br/><br/>Pwyswch <4></4> i ychwanegu manylion cofnod, neu bwyso <6></6> i ychwanegu ffotograff yn gyntaf.</0>

source: Incorrect password or email
cy: Cyfrinair neu e-bost anghywir

source: Are you sure you want to logout?<br/><br/>Your pending and uploaded <4>surveys will not be deleted </4> from this device.
cy: Ydych chi'n siŵr eich bod chi eisiau allgofnodi?<br/><br/>Ni fydd eich <4>arolygon ar y gweill ac wedi'u huwchlwytho yn cael eu dileu</4> o'r ddyfais yma.

source: Looks like your <1>{{userEmail}}</1> email hasn't been verified yet.<3><0>Refresh</0><1>Resend Email</1></3>
cy: Mae'n ymddangos nad yw eich e-bost <1>{{userEmail}}</1> wedi'i ddilysu eto. <3><0>Adnewyddu</0><1>Ail-anfon E-bost</1></3>

source: Successfully logged in as: {{email}}
cy: Wedi mewngofnodi'n llwyddiannus fel: {{e-bost}}

source: Delete account
cy: Dileu'r cyfrif

source: You can delete your user account from the system.
cy: Gallwch ddileu eich cofnod defnyddiwr o'r system.

source: This will remove your account on the iRecord website. You will lose access to any records that you have previously submitted using the app or website.
cy: Bydd hyn yn dileu eich cyfrif ar wefan iRecord. Byddwch yn colli mynediad i unrhyw gofnodion rydych chi wedi'u cyflwyno yn flaenorol gan ddefnyddio'r ap neu'r wefan.

source: Species List
cy: Rhestr Rhywogaethau

source: No site name
cy: Dim enw safle

source: Recorders
cy: Cofnodwyr

source: Add Species
cy: Ychwanegu Rhywogaethau

source: No species added
cy: Dim rhywogaethau wedi'u hychwanegu

source: Added
cy: Ychwanegwyd

source: Dominant
cy: Cryfaf

source: Abundant
cy: Toreithiog

source: Frequent
cy: Aml

source: Occasional
cy: Achlysurol

source: Rare
cy: Prin

source: Ranges
cy: Amrywio

source: No location
cy: Dim lleoliad

source: Site name eg nearby village
cy: Enw safle ee pentref cyfagos

source: Are you sure you want to delete the saved location?
cy: Ydych chi'n siŵr eich bod chi eisiau dileu'r lleoliad sydd wedi'i gadw?

source: Quantity
cy: Nifer

source: Please indicate the stage of the organism. If you are recording larvae, cases or leaf-mines please add the foodplant in to the comments field, as this is often needed to verify the records.
cy: Nodwch gyfnod yr organeb. Os ydych chi'n cofnodi larfa, cloriau neu lindys, ychwanegwch y planhigyn bwyd at y maes sylwadau, gan fod angen hyn yn aml i ddilysu'r cofnodion.

source: Larva
cy: Larfa

source: Larval web
cy: Gwe larfal

source: Larval case
cy: Clawr larfal

source: Mine
cy: Lindysyn

source: Egg
cy: Ŵy

source: Egg batch
cy: Casgliad o wyau

source: Pupa
cy: Chwiler

source: Place your species at the center of the frame.
cy: Rhowch eich rhywogaethau yng nghanol y ffrâm.

source: Suggestions
cy: Awgrymiadau

source: Great! We also think it is <1>{{probability}}%</1> likely to be <4>{{species}}</4>.
cy: Gwych! Rydyn ni hefyd yn meddwl ei bod yn <1>{{ tebygolrwydd}}%</1> debygol o fod yn <4>{{rhywogaeth}}</4>.

source: We think it is <1>{{probability}}%</1> likely to be <4>{{species}}</4>.
cy: Rydyn ni'n meddwl ei fod yn<1>{{tebygolrwydd}}%</1> debygol o fod yn <4>{{rhywogaeth}}</4>.

source: Please fill in
cy: Llenwch plîs

source: This email is already taken.
cy: Mae'r e-bost yma'n cael ei ddefnyddio eisoes.

source: email is not valid
cy: nid yw'r e-bost yn ddilys

source: The user has not been activated or is blocked.
cy: Nid yw'r defnyddiwr wedi cael ei weithredu neu mae wedi'i flocio.

source: This account is already activated.
cy: Mae'r cyfrif yma wedi'i weithredu eisoes.

source: A new verification email was successfully sent now. If you did not receive the email, then check your Spam or Junk email folders.
cy: Mae e-bost dilysu newydd wedi cael ei anfon yn llwyddiannus nawr. Os nad ydych wedi derbyn yr e-bost, gwiriwch eich ffolderi Sbam neu Jync.

source: Please pick the status.
cy: Dewiswch y statws.

source: Native
cy: Brodorol

source: Unknown
cy: Anhysbys

source: Introduced
cy: Wedi'i chyflwyno

source: Introduced - planted
cy: Wedi'i chyflwyno - ei phlannu

source: Introduced - surviving
cy: Wedi'i chyflwyno - yn goroesi

source: Introduced - casual
cy: Wedi'i chyflwyno - achlysurol

source: Introduced - established
cy: Wedi'i chyflwyno - wedi sefydlu

source: Introduced - invasive
cy: Wedi'i chyflwyno - ymledol

source: Site
cy: Safle

source: Request aborted because of a network issue (timeout or similar).
cy: Y cais wedi dod i ben oherwydd problem gyda'r rhwydwaith (wedi dod i ben neu debyg)

source: Account delete
cy: Dileu'r cyfrif

source: Are you sure you want to delete your account?
cy: Ydych chi'n siŵr eich bod chi eisiau dileu'r cyfrif?

source: Survey incomplete
cy: Arolwg yn anghyflawn

source: Please enter location and its name.
cy: Nodwch y lleoliad a'i enw.

source: Recorders field is missing.
cy: Maes cofnodwyr ar goll.

source: The attribute value was locked and will be pre-filled for subsequent records.
cy: Roedd y gwerth nodwedd wedi'i gloi a bydd yn cael ei lenwi ymlaen llaw ar gyfer cofnodion dilynol.

source: Can't lock location
cy: Methu cloi'r lleoliad

source: You can lock the location only if it was selected using a map or entered manually.
cy: Gallwch gloi'r lleoliad os cafodd ei ddewis gan ddefnyddio map neu ei nodi'n faniwal yn unig.

source: Finish
cy: Gorffen

source: (2 letters of genus + 3 of species)
cy: (2 lythyren y genws + 3 y rhywogaeth)

source: Accepted as correct'
cy: Derbyniwyd fel *cywir

source: Accepted as considered correct
cy: Derbyniwyd fel wedi'i ystyried yn gywir

source: Accepted
cy: Derbyniwyd

source: Pending review
cy: Yn aros adolygiad

source: Plausible
cy: Credadwy

source: Not accepted
cy: Heb ei dderbyn

source: Not accepted as unable to verify
cy: Heb ei dderbyn - methu dilysu

source: Not accepted as correct
cy: Heb ei dderbyn fel cywir

source: Dubious
cy: Amheus

source: Test
cy: Prawf

source: Incomplete
cy: Anghyflawn

source: Verification
cy: Dilysiad

source: verified
cy: dilyswyd

source: Thanks for sending in your record.
cy: Diolch i chi am anfon eich cofnod.

source: plausible
cy: Credadwy

source: Thanks for sending in your record. From this record details, we think it could be the <1>{{taxonName}}</1> species.
cy: Diolch i chi am anfon eich cofnod. Ar sail manylion y cofnod yma, rydyn ni'n meddwl mai <1>{{Enwtacson}}</1> ydyw.

source: rejected
cy: gwrthodwyd

source: Thanks for sending in your record. A verifier has marked it as <2>{{statusMessage}}</2> in this case. Please log in to the iRecord website to see any additional information that the verifier may have provided.
cy: Diolch i chi am anfon eich cofnod. Mae dilysydd wedi ei nodi fel <2>{{Negesstatws}}</2> yn yr achos hwn. Mewngofnodwch i wefan iRecord i weld unrhyw wybodaeth ychwanegol y gallai'r dilysydd fod wedi'i darparu.

source: Resend
cy: Ailanfon

source: Looks like your email hasn't been verified yet.
cy: Nid yw eich e-bost wedi cael ei ddilysu eto yn ôl pob tebyg.

source: Should we resend the verification email?
cy: A ddylen ni ailanfon yr e-bost dilysu?

source: email is a required field
cy: mae'r e-bost yn faes gofynnol

source: password is a required field
cy: mae'r cyfrinair yn faes gofynnol

source: iRecord website
cy: gwefan iRecord

source: Unconfirmed
cy: Heb ei gadarnhau

source: Rejected
cy: Gwrthodwyd

source: Yesterday
cy: Ddoe

source: Details
cy: Manylion

source: Verified by:
cy: Dilyswyd gan:

source: Verified on:
cy: Dilyswyd ar:

source: Count
cy: Cyfrif

source: New verified records
cy: Cofnodion newydd wedi'u dilysu

source: Some of your records have been verified. You can find those in your <2>Uploaded</2> records list.
cy: Mae rhai o'ch cofnodion wedi cael eu dilysu. Gallwch ddod o hyd i'r rheiny yn eich <2>Uploaded</2> rhestr cofnodion.

source: Do not show again
cy: Peidiwch â dangos eto

source: See records
cy: Gweld cofnodion

source: User denied access to camera
cy: Gwrthodwyd mynediad i'r camera i'r defnyddiwr

source: Location permission was denied
cy: Gwrthodwyd caniatâd lleoliad

source: email must be a valid email
cy: rhaid i'r e-bost fod yn un dilys

source: Grid Unit
cy: Uned Grid

source: You need to login to your <2>iRecord account</2> to be able to view the records.
cy: Mae angen i chi fewngofnodi i'ch <2>cyfrif iRecord</2> er mwyn gallu gweld y cofnodion.

source: We've sent an email to you
cy: Rydyn ni wedi anfon e-bost atoch chi

source: Click the link in the email to reset your password. If you don't see the email, check other places like your junk, spam or other folders.
cy: Cliciwch ar y ddolen yn yr e-bost er mwyn ailosod eich cyfrinair. Os nad ydych chi'n gweld yr e-bost, edrychwch mewn llefydd eraill fel eich ffolderi jync, sbam neu eraill.

source: Favourite
cy: Ffefryn

source: Tip: Locks for data entry
cy: Cyngor: Cloi ar gyfer cofnodion data

source: If you have added some information for one of the attributes attached to your record, you can 'lock' that information so that it is automatically added to the next record as well.<1>Swipe an attribute to the left and tap on the <2></2> button.</1><2></2>
cy: Os ydych chi wedi ychwanegu rhywfaint o wybodaeth ar gyfer un o'r nodweddion sydd wedi'u hatodi gyda'ch cofnod, gallwch 'gloi' yr wybodaeth honno fel ei bod yn cael ei hychwanegu'n awtomatig at y cofnod nesaf hefyd.<1>Sweipiwch nodwedd i'r chwith a thapio ar y < 2 ></2> botwm.</1><2></2>

source: Cocoon
cy: Cocŵn

source: Mine (empty)
cy: Clawr lindysyn (gwag)

source: Mine (tenanted)
cy: Clawr lindysyn (llawn)

source: Case
cy: Clawr

source: Nymph
cy: Nymff

source: Gall
cy: Coden

source: Dead
cy: Marw

source: Sorry, looks like you're offline.
cy: Sori, dydych chi ddim ar-lein

source: timeout
cy: amser wedi dod i ben

source: Location services are not enabled
cy: Nid yw'r gwasanaethau lleoliad wedi'u galluogi
